Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::RoutingElement::Modifier Class Reference
MEP Element Manager
Modifier of the RoutingElement. More...
#include <MEPRoutingElement.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingElement::Modifier:
 Public Member Functions
Result< void >  | Inject (const RoutingElementDefault &routingElementDefault)
Injects the given Default settings to the RoutingElement.
void  | SetMEPSystem (const API_AttributeIndex &index)
Sets the MEPSystem attribute of the RoutingElement.
Result< void >  | SetBranchPreferenceTableId (const UniqueID &uniqueId)
Sets the Branch PreferenceTable of the RoutingElement.
Result< void >  | SetFloorPlanDisplayOption (FloorPlanDisplayOption floorPlanDisplayOption)
Sets the Floor Plan Display Option of the RoutingElement.
void  | SetCutPlanePosition (CutPlanePosition cutPlanePos)
Sets the Cut Plane Position of the RoutingElement.
Result< void >  | SetShowProjection (ShowProjection showProjection)
Sets the Show Projection setting of the RoutingElement.
void  | SetOnStoryVisibility (OnStoryVisibility onStoryVisibility)
Sets the Show On Stories setting of the RoutingElement.
Result< void >  | SetRoutingSegmentDefaultParameters (const RoutingSegmentDefault &routingSegmentDefault)
Sets the parameters of the uncustomized RoutingSegments.
Result< void >  | SetRoutingNodeDefaultParameters (const RoutingNodeDefault &routingNodeDefault)
Sets the parameters of the uncustomized RoutingNodes.
Result< RouteConnectionResult >  | ConnectLogically (const UniqueID &uniqueId)
Connects logically this RoutingElement with the parameter MEPElement or RoutingElement, if they can be connected.
 Protected Member Functions
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the RoutingElement.
Member Function Documentation
◆ ConnectLogically()
 Result< RouteConnectionResult > ACAPI::MEP::RoutingElement::Modifier::ConnectLogically  |  ( |  const UniqueID & |  uniqueId | )
Connects logically this RoutingElement with the parameter MEPElement or RoutingElement, if they can be connected.
In case of RoutingElements, the two of them have to match in domain, MEPSystem and they need to have an intersection point which will serve as a connection. Depending on geometry this could mean the merge of two RoutingElements (when one is a continuation of the other), or insertion of a Branch element (when three RoutingElements meet, or one is connected into another's RoutingSegment). Either the beginning or the end node of the RoutingElement given as a parameter must intersect the RoutingElement from which Connect was called. In case of other MEPElements, their connecting ports have to match in domain, MEPSystem and have to be positioned and oriented correctly. The direction vector of the ports have to point in opposite directions. The above mentioned requirements are enough to form a logical connection, however for a physical Port-Port connection to be created, please look for further guidance at PortBase::IsPhysicallyConnectable.
Parameters
uniqueId | The UniqueID of the MEPElement or RoutingElement which will be connected to this RoutingElement.
Returns
Returns an error in case of domain, MEPSystem mismatch or if they can not be connected geometrically, otherwise RouteConnectionResult will contain as deletedRoutingElementId the RoutingElement given as parameter, or the id of the newly created RoutingElement, split from the original RoutingElement.
◆ Inject()
 Result< void > ACAPI::MEP::RoutingElement::Modifier::Inject  |  ( |  const RoutingElementDefault & |  routingElementDefault | )
Injects the given Default settings to the RoutingElement.
Parameters
routingElementDefault | The Default which will be injected. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ SetBranchPreferenceTableId()
 Result< void > ACAPI::MEP::RoutingElement::Modifier::SetBranchPreferenceTableId  |  ( |  const UniqueID & |  uniqueId | )
Sets the Branch PreferenceTable of the RoutingElement.
Parameters
uniqueId | The UniqueID of the PreferenceTable.
Returns
Returns an error if the parameter does not identify a Branch PreferenceTable, otherwise nothing.
◆ SetCutPlanePosition()
 void ACAPI::MEP::RoutingElement::Modifier::SetCutPlanePosition  |  ( |  CutPlanePosition |  cutPlanePos | )
Sets the Cut Plane Position of the RoutingElement.
Parameters
cutPlanePos | The Cut Plane Position to be set.
◆ SetFloorPlanDisplayOption()
 Result< void > ACAPI::MEP::RoutingElement::Modifier::SetFloorPlanDisplayOption  |  ( |  FloorPlanDisplayOption |  floorPlanDisplayOption | )
Sets the Floor Plan Display Option of the RoutingElement.
Parameters
floorPlanDisplayOption | The Floor Plan Display Option to be set.
Returns
Returns an error if the cut plane position is set to 'By Upper Display Limit' and we try to pass a 'Projected With Overhead' floor plan display option, otherwise nothing
◆ SetMEPSystem()
 void ACAPI::MEP::RoutingElement::Modifier::SetMEPSystem  |  ( |  const API_AttributeIndex & |  index | )
Sets the MEPSystem attribute of the RoutingElement.
Parameters
index | The AttributeIndex of the MEPSystem attribute.
◆ SetOnStoryVisibility()
 void ACAPI::MEP::RoutingElement::Modifier::SetOnStoryVisibility  |  ( |  OnStoryVisibility |  onStoryVisibility | )
Sets the Show On Stories setting of the RoutingElement.
Parameters
onStoryVisibility | The Show On Stories setting to be set.
◆ SetRoutingNodeDefaultParameters()
 Result< void > ACAPI::MEP::RoutingElement::Modifier::SetRoutingNodeDefaultParameters  |  ( |  const RoutingNodeDefault & |  routingNodeDefault | )
Sets the parameters of the uncustomized RoutingNodes.
On Archicad's user interface, in the editing mode of a RoutingElement, its RoutingNodes can be customized separately. This function provides the opportunity for setting the uncustomized RoutingNode parameters in the RoutingElement.
Parameters
routingNodeDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.
◆ SetRoutingSegmentDefaultParameters()
 Result< void > ACAPI::MEP::RoutingElement::Modifier::SetRoutingSegmentDefaultParameters  |  ( |  const RoutingSegmentDefault & |  routingSegmentDefault | )
Sets the parameters of the uncustomized RoutingSegments.
On Archicad's user interface, in the editing mode of a RoutingElement, its RoutingSegments can be customized separately. This function provides the opportunity for setting the uncustomized RoutingSegment parameters in the RoutingElement.
Parameters
routingSegmentDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.
◆ SetShowProjection()
 Result< void > ACAPI::MEP::RoutingElement::Modifier::SetShowProjection  |  ( |  ShowProjection |  showProjection | )
Sets the Show Projection setting of the RoutingElement.
Parameters
showProjection | The Show Projection setting to be set.
Returns
Returns an error if the FloorPlanDisplayOption is set to Symbolic, otherwise nothing.